In [82]:
import pandas as pd

#Import data archive
#Use data .read_[Type]("Link")
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [83]:
df.head() #Read entire table
#df.head(10) #Read only the 10 first columns

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [36]:
df.info() #Bring important info. about your df

<class 'pandas.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  str
 2   employment_type     133349 non-null  str
 3   job_title           133349 non-null  str
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  str
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  str
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  str
 10  company_size        133349 non-null  str
dtypes: float64(1), int64(3), str(7)
memory usage: 11.2 MB

In [37]:
df.describe() #Shows you statistics about your df (Max, min, mean, average)

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [84]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='str')

In [ ]:
df.shape #If you run it, shows you the size of the archive (lines x columns)
line, column = df.shape[0], df.shape[1] #Vetor 0 save the information of lines, and vector 1 save the number of columns.
print("Number of Lines: ", line) #saving numbers into variable and print
print("Number of Columns: ", column) #saving numbers into variable and print

Number of Lines:  133349
Number of Columns:  11

In [85]:
#Create a dictionary for you df
dictionary_columns_ptbr = {
    "work_year": "ano",
    "experience_level": "senioridade",
    "employment_type": "contrato",
    "job_title": "cargo",
    "salary": "salario",
    "salary_currency": "moeda",
    "salary_in_usd": "usd",
    "employee_residence": "residencia",
    "remote_ratio": "remoto",
    "company_location": "empresa",
    "company_size": "tamanho_empresa"
}

df = df.rename(columns=dictionary_columns_ptbr)
df.columns

Index(['ano', 'senioridade', 'contrato', 'cargo', 'salario', 'moeda', 'usd',
       'residencia', 'remoto', 'empresa', 'tamanho_empresa'],
      dtype='str')

In [86]:
df["senioridade"].value_counts() #Show you the resume of counts of itens in your column

senioridade
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [87]:
df["contrato"].value_counts() #Show you the resume of counts of itens in your column

contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [64]:
df["remoto"].value_counts() #Show you the resume of counts of itens in your column

remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [65]:
df["tamanho_empresa"].value_counts() #Show you the resume of counts of itens in your column

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [88]:
dictionary_senioridade_column_ptbr = {
    "SE": "Senior",
    "MI": "Pleno",
    "EN": "Junior",
    "EX": "Executivo",
}

df["senioridade"] = df["senioridade"].replace(dictionary_senioridade_column_ptbr)
df["senioridade"].value_counts()

senioridade
Senior       77241
Pleno        40465
Junior       12443
Executivo     3200
Name: count, dtype: int64

In [89]:
#Create a dictionary for the data into the columns (Contrato)
dictionary_contrato_column_ptbr = {
    "FT": "Tempo Integral",
    "CT": "Tempo Parcial",
    "PT": "Freela",
    "FL": "Contrato",
}

df["contrato"] = df["contrato"].replace(dictionary_contrato_column_ptbr)
df["contrato"].value_counts()

contrato
Tempo Integral    132563
Tempo Parcial        394
Freela               376
Contrato              16
Name: count, dtype: int64

In [90]:
#Create a dictionary for the data into the columns (tamanho_empresa)
dictionary_tamanho_empresa_column_ptbr = {
    "S": "Pequena",
    "M": "Media",
    "L": "Grande"
}

df["tamanho_empresa"] = df["tamanho_empresa"].replace(dictionary_tamanho_empresa_column_ptbr)
df["tamanho_empresa"].value_counts()

tamanho_empresa
Media      129561
Grande       3574
Pequena       214
Name: count, dtype: int64

In [92]:
#Create a dictionary for the data into the columns (remoto)
dictionary_remoto_column_ptbr = {
    0: "Presencial",
    50: "Remoto",
    100: "Hibrido"
}

df["remoto"] = df["remoto"].replace(dictionary_remoto_column_ptbr)
df["remoto"].value_counts()

remoto
Presencial    105312
Hibrido        27718
Remoto           319
Name: count, dtype: int64

In [93]:
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Hibrido,US,Media
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Hibrido,US,Media
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Media
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Media
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Media

In [95]:
#Count: How many itens this column have in the total
#Unique: How many unique values this category have (Executivo, pleno, senior, junior)
#Top: Which information shows with more frequecy
#Freq: Cal. of the frequency (How many times the top value repeat)

df.describe(include="object")

C:\Users\Vitor Cardoso\AppData\Local\Temp\ipykernel_5660\14690604.py:6: Pandas4Warning: For backward compatibility, 'str' dtypes are included by select_dtypes when 'object' dtype is specified. This behavior is deprecated and will be removed in a future version. Explicitly pass 'str' to `include` to select them, or to `exclude` to remove them and silence this warning.
See https://pandas.pydata.org/docs/user_guide/migration-3-strings.html#string-migration-select-dtypes for details on how to write code that works with pandas 2 and 3.
  df.describe(include="object")

,senioridade,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Senior,Tempo Integral,Data Scientist,USD,US,Presencial,US,Media
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [96]:
#Checking for null (empty) fields
df.isnull()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
133344,False,False,False,False,False,False,False,False,False,False,False
133345,False,False,False,False,False,False,False,False,False,False,False
133346,False,False,False,False,False,False,False,False,False,False,False
133347,False,False,False,False,False,False,False,False,False,False,False
133348,False,False,False,False,False,False,False,False,False,False,False

In [97]:
#checking the SUM of all empty fields by category
df.isnull().sum()

ano                10
senioridade         0
contrato            0
cargo               0
salario             0
moeda               0
usd                 0
residencia          0
remoto              0
empresa             0
tamanho_empresa     0
dtype: int64

In [98]:
#Check all the unique values in the ano column
df["ano"].unique()

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [107]:
#Show all the lines that have at least one empty field
df[df.isnull().any(axis=1)]

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
5588,NaN,Senior,Tempo Integral,Product Manager,184500,USD,184500,US,Presencial,US,Media
59692,NaN,Pleno,Tempo Integral,Engineer,110000,USD,110000,DE,Presencial,DE,Media
59710,NaN,Junior,Tempo Integral,Data Scientist,208800,USD,208800,US,Presencial,US,Media
59759,NaN,Senior,Tempo Integral,Software Engineer,135000,USD,135000,US,Presencial,US,Media
59789,NaN,Senior,Tempo Integral,Engineer,112000,USD,112000,US,Presencial,US,Media
131000,NaN,Senior,Tempo Integral,Machine Learning Engineer,163800,USD,163800,US,Presencial,US,Media
131006,NaN,Senior,Tempo Integral,Data Analytics Manager,204500,USD,204500,US,Presencial,US,Media
133054,NaN,Junior,Tempo Integral,Data Scientist,40000,USD,40000,JP,Hibrido,MY,Grande
133281,NaN,Pleno,Tempo Integral,Machine Learning Engineer,180000,PLN,46597,PL,Hibrido,PL,Grande
133317,NaN,Pleno,Tempo Integral,Data Scientist,130000,USD,130000,US,Remoto,US,Grande

In [ ]:
#Creating a new data frame
import numpy as np #Use for number manipulation (In this case to add null values in the code "np.num")

df_salarios = pd.DataFrame({
    'nome' : ['Ana', 'Bruno', 'Carlos', 'Daniele', 'Val'], #column and attributes
    'salario' : [4000, np.nan, 5000, np.nan, 100000] #column and attributes
})

#creating a new column in the new df and it calculates the average (mean), replaces the zeros with the average, and rounds off values.
df_salarios['salario_media'] = df_salarios['salario'].fillna(df_salarios['salario'].mean().round(2))

#creating a new column in the new df and it calculates the median, replaces the zeros with the average, and rounds off values.
df_salarios['salario_mediana'] = df_salarios['salario'].fillna(df_salarios['salario'].median().round(2))
df_salarios

      nome   salario  salario_media  salario_mediana
0      Ana    4000.0        4000.00           4000.0
1    Bruno       NaN       36333.33           5000.0
2   Carlos    5000.0        5000.00           5000.0
3  Daniele       NaN       36333.33           5000.0
4      Val  100000.0      100000.00         100000.0

In [ ]:
df_temperaturas = pd.DataFrame({
    'dia' : ['Segunda', 'Terca', 'Quarta', 'Quinta', 'Sexta'], #column and attributes
    'temperatura' : [30, np.nan, np.nan, 28, 27] #column and attributes
})

#ffill = 'Forward fill' fill out the empty spaces with the previouly available value
df_temperaturas['preenchido_ffill'] = df_temperaturas['temperatura'].ffill()
df_temperaturas

       dia  temperatura  preenchido_ffill
0  Segunda         30.0              30.0
1    Terca          NaN              30.0
2   Quarta          NaN              30.0
3   Quinta         28.0              28.0
4    Sexta         27.0              27.0

In [121]:
# Creating a new DataFrame (test example 3)
df_cidades = pd.DataFrame({
    'nome': ['Ana', 'Bruno', 'Carlos', 'Daniele', 'Val'],  # column names and values
    'cidade': ['SÃ£o Paulo', np.nan, 'Curitiba', np.nan, 'BelÃ©m']  # missing cities values
})

# Fill missing city values with a default label
df_cidades['cidade preenchida'] = df_cidades['cidade'].fillna('NÃ£o Informado')
df_cidades

      nome     cidade cidade preenchida
0      Ana  SÃ£o Paulo         SÃ£o Paulo
1    Bruno        NaN     NÃ£o Informado
2   Carlos   Curitiba          Curitiba
3  Daniele        NaN     NÃ£o Informado
4      Val      BelÃ©m             BelÃ©m

In [ ]:
# Remove all rows containing at least one missing value
df_limpo = df.dropna()

# Verify that no missing values remain
df_limpo.isnull().sum()

ano                0
senioridade        0
contrato           0
cargo              0
salario            0
moeda              0
usd                0
residencia         0
remoto             0
empresa            0
tamanho_empresa    0
dtype: int64